{
  "title": "Tests fonctionnels",
  "cells": [
    {
      "type": "markdown",
      "data": "   1 # Tests Fonctionnels\n-  2 WebTestCase permet de simuler un navigateur.  Avec Panther, on peut faire des classes de tests qui héritent de PantherTestCase.  L'avantage de PantherTestCase est qu'on va communiquer avec un vrai navigateur (chrome). (Bientôt Firefox) Permet d'exécuter du JS, etc,  -    contrairement à WebTestCase. Sinon les API sont exactement les mêmes.  Sur le repo GitHub, on a un driver nommé _WebDriver_ qui assure la communication entre Symfony et Chrome.\n|  3\n|  4 On a 3 choses dans Symfony pour les tests fonctionnels :\n|  5 1. PhpUNIT\n|  6 2. Client\n|  7 3. Crawler\n|  8\n|  9 ### Client\n+ 10 +----  4 lines: Le __client__ s'occupe de la partie _requête HTTP_. -------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n2 14 ### Crawler\n- 15 Le __crawler__ navigue dans la page et trouve des élements. Genre de _DOM_ qui va nous permettre de naviguer, trouver des éléments en naviguant dans des noeuds.\n3 16\n3 17 L'écrite des tests va être la combinaison de tout ça.\n3 18\n3 19 ```php\n3 20 <?php\n3 21\n3 22 class FunctionnalTest() o\n3 23     $client = $static::createClient();\n3 24     $crawler = $client->request()\n3 25 }\n3 26\n3 27\n3 28 ```\n3 29\n3 30 Dans Symfony, on a la classe DOMCrawler qui permet d'accéder à toutes les fonctionnalités de navigation dans la page.\n3 31 On peut donc afficher une page, et chercher des éléments dans cette page.\n3 32\n3 33 __Exercice__ :\n3 34\n3 35 On arrive sur la page d'accueil. Liste de liens (évènements par exemple).\n3 36 Sur chaque lien, on est capable de récupérer le lien qui correspond au premier évènement (par exemple). On est capable d'aboutir sur cette page, et de vérifier qu'on a bien un titre qui correspond au nom de l'artiste.\n3 37\n3 38 On peut créer un test fonctionnel avec la commande `"
    }
  ]
}